# equality01
mkdir -p out; rules2ldl | ldlsat --validity
<<<
property x = x;
>>>
valid
>>>=0

# equality02
rules2ldl | ldlsat --validity
<<<
property x = y -> y = x;
>>>
valid
>>>=0

# equality03
rules2ldl | ldlsat --validity
<<<
variable x, y, z : nat (4); // 0 <= x, y, z <= 3
property x = y & y = z -> x = z;
>>>
valid
>>>=0

# equality04
rules2ldl | ldlsat --validity
<<<
property x = y | x != y;
>>>
valid
>>>=0

#
rules2ldl | ldlsat --validity
<<<
variable x : nat (4);
property x != 4;
>>>
valid
>>>=0
